{
  "PalTamFon21": "Beyond Technical Aspects: How Do Community Smells Influence the Intensity of Code Smells?",
  "ZamFucSer21": "Self-admitted technical debt practices: a comparison between industry and open-source.",
  "WanChaGot21": "oo7: Low-Overhead Defense Against Spectre Attacks via Program Analysis.",
  "AliLaiLuo21": "A Study of Call Graph Construction for JVM-Hosted Languages.",
  "QuaLamAda21": "Evaluating the impact of falsely detected performance bug-inducing changes in JIT models.",
  "PerAbrDeu21": "A Theoretical and Empirical Analysis of Program Spectra Diagnosability.",
  "CasFirCoh21": "An empirical investigation of organic software product lines.",
  "HeiBuy21": "A Cost-Efficient Auto-Scaling Algorithm for Large-Scale Graph Processing in Cloud Environments with Heterogeneous Resources.",
  "OlsRisBes21": "Measuring affective states from technical debt.",
  "AleMar21": "E-APR: Mapping the effectiveness of automated program repair techniques.",
  "GhaWhaGac21": "Inductive Validity Cores.",
  "ShaHieMcC21": "Finding Substitutable Binary Code By Synthesizing Adapters.",
  "NovCalLan21": "Assessment of off-the-shelf SE-specific sentiment analysis tools: An extended replication study.",
  "WanXiaHas21": "What Do Programmers Discuss About Blockchain? A Case Study on the Use of Balanced LDA and the Reference Architecture of a Domain to Capture Online Discussions About Blockchain Platforms Across Stack Exchange Communities.",
  "JinLiuCai21": "Service Candidate Identification from Monolithic Systems Based on Execution Traces.",
  "QuYin21": "Evaluating network embedding techniques&apos; performances in software bug prediction.",
  "NugIslNak21": "How are project-specific forums utilized? A study of participation, content, and sentiment in the Eclipse ecosystem.",
  "NayRuhZim21": "Mining Treatment-Outcome Constructs from Sequential Software Engineering Data.",
  "OliOliCas21": "Improving energy-efficiency by recommending Java collections.",
  "ShrNicFah21": "Assessing practitioner beliefs about software engineering."
}